blog/22.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-15 Wed 23:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 2.5 Systems with Generic Operations</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 2.5 Systems with Generic Operations
<br />
<span class="subtitle">2023-11-15 Wed</span>
</h1>

<div id="outline-container-orgbccc6f4" class="outline-2">
<h2 id="orgbccc6f4">2.5.1 Generic Arithmetic Operations</h2>
<div class="outline-text-2" id="text-orgbccc6f4">
<p>
In 2.5.1, Authors show how to define generic operations that can take
different types of arguments (in our case different types of numbers),
for example a generic <code>add</code> that works with ordinary numbers as well
as with rational and complex numbers.  The technique used to define
such generic operations is the same way that has been used to define
the generic operations (selectors) in the case of complex numbers (in
2.4.3).
</p>
</div>
<div id="outline-container-orgd66ddce" class="outline-3">
<h3 id="orgd66ddce">Exercise 2.77</h3>
<div class="outline-text-3" id="text-orgd66ddce">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Louis Reasoner tries to evaluate the expression <code>(magnitude z)</code> where
<code>z</code> is the object shown in Figure 2-24.  To his surprise, instead of
the answer 5 he gets an error message from <code>apply-generic</code>, saying
there is no method for the operation <code>magnitude</code> on the types
<code>(complex)</code>.  He shows this interaction to Alyssa P. Hacker, who says
"The problem is that the complex-number selectors were never defined
for <code>complex</code> numbers, just for <code>polar</code> and <code>rectangular</code> numbers.
All you have to do to make this work is add the following to the
<code>complex</code> package:"
</p>

<div class="org-src-container">
<pre class="src src-scheme">(put 'real-part '(complex) real-part)
(put 'imag-part '(complex) imag-part)
(put 'magnitude '(complex) magnitude)
(put 'angle '(complex) angle)
</pre>
</div>

<p>
Describe in detail why this works.  As an example, trace through all
the procedures called in evaluating the expression <code>(magnitude z)</code>
where <code>z</code> is the object shown in Figure 2-24.  In particular, how many
times is <code>apply-generic</code> invoked?  What procedure is dispatched to in
each case?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
Here is <code>z</code>:
</p>
<pre class="example">

--&gt;[o|o]--&gt;[o|o]--------&gt;[o|o]
    |       |             | |
    v       v             v v
'complex  'rectangular    3 4
</pre>

<p>
Louis evaluates <code>(magnitude z)</code>.
</p>

<p>
Louis is using the procedure defined as follows:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">magnitude</span> z)
  (apply-generic 'magnitude z))
</pre>
</div>

<p>
This means that when calling <code>magnitude</code>, the first thing we do is
looking in the table for the item specified by the row <code>'magnitude</code>
and column <code>'complex</code> (the type of <code>z</code>).
</p>

<p>
However, nobody has stored such a table item. (At the moment there is
an element specified by row <code>'magnitude</code> and column <code>'rectangular</code>,
and an element specified by row <code>'magnitude</code> and column <code>'polar</code>.) So,
Louis' invocation produces an error.
</p>

<p>
Alyssa's code adds to the table four objects. Those objects are the
generic procedures defined on page 84, which are themselves designed
to look for and use an object in the table.
</p>

<p>
So, now, when Louis calls <code>(magnitude z)</code>, we look for a table item
which exists. It's the item which has been installed by Alyssa with
this line:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(put 'magnitude '(complex) magnitude)
</pre>
</div>

<p>
Given that we find an item in the table, <code>apply-generic</code> applies it to
the <code>contents</code> of <code>z</code>. These are the <code>contents</code> of <code>z</code>:
</p>

<pre class="example">
    [o|o]------&gt;[o|o]
     |           | |
     v           v v
'rectangular     3 4
</pre>

<p>
Applying <code>magnitude</code> to these contents means, again, looking for an
item in the table. This time we are looking for the item specified the
row <code>'magnitude</code> and the column <code>'rectangular</code>. That item is found and
applied to the contents.
</p>

<p>
Table before Alyssa's change:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">rectangular</th>
<th scope="col" class="org-left">polar</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">magnitude</td>
<td class="org-left">magnitude-rectangular</td>
<td class="org-left">magnitude-polar</td>
</tr>

<tr>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


<p>
Table after Alyssa's change:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">complex</th>
<th scope="col" class="org-left">rectangular</th>
<th scope="col" class="org-left">polar</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">magnitude</td>
<td class="org-left">magnitude</td>
<td class="org-left">magnitude-rectangular</td>
<td class="org-left">magnitude-polar</td>
</tr>

<tr>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
When evaluating <code>(magnitude z)</code>, after Alyssa's contribution,
<code>apply-generic</code> is called twice. The first time it dispatches to
<code>magnitude</code> to itself (in a sense, <code>magnitude</code>, through
<code>apply-generic</code>, is dispatching to itself). The second time it
dispatches to <code>magnitude-rectangular</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(magnitude z) <span style="color: #595959;">;; </span><span style="color: #595959;">z:  --&gt;[o|o]--&gt;[o|o]--------&gt;[o|o]</span>
              <span style="color: #595959;">;;         </span><span style="color: #595959;">|       |             | |</span>
              <span style="color: #595959;">;;         </span><span style="color: #595959;">v       v             v v</span>
              <span style="color: #595959;">;;     </span><span style="color: #595959;">'complex  'rectangular    3 4</span>
<span style="color: #595959;">;;    </span><span style="color: #595959;">|</span>
<span style="color: #595959;">;;    </span><span style="color: #595959;">|</span>
<span style="color: #595959;">;;    </span><span style="color: #595959;">V</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">apply-generic</span>
<span style="color: #595959;">;;    </span><span style="color: #595959;">|</span>
<span style="color: #595959;">;;    </span><span style="color: #595959;">|</span>
<span style="color: #595959;">;;    </span><span style="color: #595959;">V</span>
(magnitude z') <span style="color: #595959;">;; </span><span style="color: #595959;">z': --&gt;[o|o]--------&gt;[o|o]</span>
               <span style="color: #595959;">;;         </span><span style="color: #595959;">|             | |</span>
               <span style="color: #595959;">;;         </span><span style="color: #595959;">v             v v</span>
               <span style="color: #595959;">;;       </span><span style="color: #595959;">'rectangular    3 4</span>
<span style="color: #595959;">;;    </span><span style="color: #595959;">|</span>
<span style="color: #595959;">;;    </span><span style="color: #595959;">|</span>
<span style="color: #595959;">;;    </span><span style="color: #595959;">V</span>
<span style="color: #595959;">;;  </span><span style="color: #595959;">apply-generic</span>
<span style="color: #595959;">;;    </span><span style="color: #595959;">|</span>
<span style="color: #595959;">;;    </span><span style="color: #595959;">|</span>
<span style="color: #595959;">;;    </span><span style="color: #595959;">V</span>
(magnitude z'') <span style="color: #595959;">;; </span><span style="color: #595959;">z'': --&gt;[o|o]</span>
                <span style="color: #595959;">;;          </span><span style="color: #595959;">| |</span>
                <span style="color: #595959;">;;          </span><span style="color: #595959;">v v</span>
                <span style="color: #595959;">;;          </span><span style="color: #595959;">3 4</span>
</pre>
</div>

<p>
Basically, Alyssa's line, has the effect of making <code>magnitude</code>
stripping off <code>'complex</code> before dispatching to someone else.
</p>
</div>
</div>
