blog/22.html
<div id="outline-container-org38eaad5" class="outline-3">
<h3 id="org38eaad5">Exercise 2.78</h3>
<div class="outline-text-3" id="text-org38eaad5">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
The internal procedures in the <code>scheme-number</code> package are essentially
nothing more than calls to the primitive procedures <code>+</code>, <code>-</code>, etc. It
was not possible to use the primitives of the language directly
because our type-tag system requires that each data object have a type
attached to it. In fact, however, all Lisp implementations do have a
type system, which they use internally. Primitive predicates such as
<code>symbol?</code> and <code>number?</code> determine whether data objects have particular
types. Modify the definitions of <code>type-tag</code>, <code>contents</code>, and
<code>attach-tag</code> from section 2-4-2 so that our generic system takes
advantage of Scheme's internal type system. That is to say, the system
should work as before except that ordinary numbers should be
represented simply as Scheme numbers rather than as pairs whose <code>car</code>
is the symbol <code>scheme-number</code>.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">type-tag</span> datum)
  (<span style="color: #531ab6;">cond</span> ((number? datum) 'scheme-number)
        ((pair? datum) (car datum))
        (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Bad tagged datum -- TYPE-TAG"</span> datum))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">contents</span> datum)
  (<span style="color: #531ab6;">cond</span> ((number? datum) datum)
        ((pair? datum) (cdr datum))
        (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Bad tagged datum -- CONTENTS"</span> datum))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">attach-tag</span> type-tag contents)
  (<span style="color: #531ab6;">if</span> (number? contents)
      contents
      (cons type-tag contents)))
<span style="color: #595959;">;; </span><span style="color: #595959;">alternatively</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">attach-tag</span> type-tag contents)
  (<span style="color: #531ab6;">if</span> (eq? type-tag 'scheme-number)
      contents
      (cons type-tag contents)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6a4009a" class="outline-3">
<h3 id="org6a4009a">Exercise 2.79</h3>
<div class="outline-text-3" id="text-org6a4009a">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Define a generic equality predicate <code>equ?</code> that tests the equality of
two numbers, and install it in the generic arithmetic package. This
operation should work for ordinary numbers, rational numbers, and
complex numbers.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
I guess, first of all:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">equ?</span> x y) apply-generic 'equ? x y)
</pre>
</div>

<p>
After this, we should put the specific procedures for the types of
numbers we have:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(put 'equ? '(scheme-number scheme-number)
     (<span style="color: #531ab6;">lambda</span> (x y) (= x y)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(put 'equ? '(rational rational)
     (<span style="color: #531ab6;">lambda</span> (x y) (<span style="color: #531ab6;">and</span> (= (car x) (car y))
                        (= (cdr x) (cdr y)))))
</pre>
</div>
<p>
(if <code>equ?</code> for rational numbers was defined within the
<code>install-rational-package</code> procedure we could make use of <code>number</code> and
<code>denom</code>)
</p>

<div class="org-src-container">
<pre class="src src-scheme">(put 'equ? '(complex complex)
     (<span style="color: #531ab6;">lambda</span> (x y) (<span style="color: #531ab6;">and</span> (= (real-part x) (real-part y))
                        (= (imag-part x) (imag-part y)))))
</pre>
</div>
<p>
(<code>Real-part</code> and <code>imag-part</code>, if I'm not wrong, here work correctly
thanks to the code added by Alyssa P. Hacker in ex. 2.77.)
</p>

<p>
(Alternatively, we could have used <code>magnitude</code> and <code>angle</code>, instead of
<code>real-part</code> and <code>imag-part</code>.)
</p>
</div>
</div>
<div id="outline-container-orgbf5cbf0" class="outline-3">
<h3 id="orgbf5cbf0">Exercise 2.80</h3>
<div class="outline-text-3" id="text-orgbf5cbf0">
<p>
Exercise*:
</p>

<blockquote>
<p>
Define a generic predicate <code>=zero?</code> that tests if its argument is
zero, and install it in the generic arithmetic package. This operation
should work for ordinary numbers, rational numbers, and complex
numbers.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">=zero?</span> x)
  (apply-generic =zero? x))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(put '=zero '(scheme-number scheme-number)
     (<span style="color: #531ab6;">lambda</span> (x) (= x 0)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(put '=zero '(rational rational)
     (<span style="color: #531ab6;">lambda</span> (x)
       (<span style="color: #531ab6;">and</span> (= (car x) 0)
            (not (= (cdr x) 0)))))
<span style="color: #595959;">;; </span><span style="color: #595959;">the numerator must be zero and the denominator must be non-zero</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(put '=zero '(complex)
     (<span style="color: #531ab6;">lambda</span> (x)
       (<span style="color: #531ab6;">and</span> (= (real-part x) 0)
            (= (imag-part x) 0))))
</pre>
</div>

<p>
Alternatively:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(put '=zero '(complex)
     (<span style="color: #531ab6;">lambda</span> (x)
       (= (angle x) 0)))
</pre>
</div>
</div>
</div>
</div>
