blog/22.org
* 2.5.2 Combining Data of Different Types
So far we have considered operations on objects of the same type. For
example, the addition of two ordinary numbers or the multiplication of
two rational numbers. But this means that the operations we have
defined ``treat the different data types as being completely
independent.''. We haven't dealt with, say the addition of an ordinary
number and a rational number, or the division of a rational number and
a complex number. How should we introduce ``cross-type'' operations in
our system?

#+begin_quote
one way to handle cross-type operations is to design a different
procedure for each possible combination of types for which the
operation is valid. [...] this technique works, but it is cumbersome.
#+end_quote

When we can, we should be ``by taking advantage of additional
structure that may be latent in our type system'': often an object of
a certain data type can be seen as an object of a another data
type. E.g., the rational number 2/2, can be seen as the ordinary
number 1. Given so, if we are asked to perform an operation on a
rational number and an ordinary number, we could try to ``coerce'' the
rational number into an ordinary number. And if we are successful in
doing so, then we can use our good old procedure that works with
ordinary numbers.

The coercion idea can be implement by designing coercion procedures,
installing them into a coercion table, and then modifying
~apply-generic~.

#+begin_src scheme
  (define (scheme-number->complex n)
    (make-complex-from-real-imag (contents n) 0))

  (put-coercion 'scheme-number 'complex scheme-number->complex)

  ;; For simplicity, only the case in which there are two arguments is
  ;; considered
  (define (apply-generic op . args)
    (let ((type-tags (map type-tag args)))
      (let ((proc (get op type-tags)))
        (if proc
            (apply proc (map contents args))
            (if (= (length args) 2)
                (let ((type1 (car type-tags))
                      (type2 (cadr type-tags))
                      (a1 (car args))
                      (a2 (cadr args)))
                  (let ((t1->t2 (get-coercion type1 type2))
                        (t2->t1 (get-coercion type2 type1)))
                    (cond (t1->t2
                           (apply-generic op (t1->t2 a1) a2))
                          (t2->t1
                           (apply-generic op a1 (t2->t1 a2)))
                          (else
                           (error "No method for these types"
                                  (list op type-tags))))))
                (error "No method for these types"
                       (list op type-tags)))))))
#+end_src

This coercion scheme is useful, but not general enough: there may be
cases in which it's not possible neither object can be converted into
the type of the other object, but in which both objects could be
converted to a third type.

** Exercise 2.81
*Exercise*:

#+begin_quote
Louis Reasoner has noticed that ~apply-generic~ may try to coerce the
arguments to each other's type even if they already have the same
type. Therefore, he reasons, we need to put procedures in the coercion
table to ``coerce'' arguments of each type to their own type. For
example, in addition to the ~scheme-number->complex~ coercion shown
above, he would do:

#+begin_src scheme
  (define (scheme-number->scheme-number n) n)
  (define (complex->complex z) z)
  (put-coercion 'scheme-number 'scheme-number
  scheme-number->scheme-number)
  (put-coercion 'complex 'complex complex->complex)
#+end_src

a. With Louis's coercion procedures installed, what happens if
~apply-generic~ is called with two arguments of type ~scheme-number~
or two arguments of type ~complex~ for an operation that is not found
in the table for those types? For example, assume that we've defined a
generic exponentiation operation:

#+begin_src scheme
  (define (exp x y) (apply-generic 'exp x y))
#+end_src

and have put a procedure for exponentiation in the Scheme-number
package but not in any other package:

#+begin_src scheme
  ;; following added to Scheme-number package
  (put 'exp '(scheme-number scheme-number)
  (lambda (x y) (tag (expt x y)))) ; using primitive `expt'
#+end_src

What happens if we call ~exp~ with two complex numbers as arguments?

b. Is Louis correct that something had to be done about coercion with
arguments of the same type, or does ~apply-generic~ work correctly as
is?

c. Modify ~apply-generic~ so that it doesn't try coercion if the two
arguments have the same type.
#+end_quote

*Answer*:

*** a
If we call ~exp~ with two complex numbers, we would call

#+begin_src scheme
  (apply-generic 'exp CN1 CN2)
#+end_src

We are not going to find a procedure, because we don't have an object
in the table for row ~'exp~ and column ~'(complex complex)~.

So we would go inside the second ~if~.

Both ~t1->t2~ and ~t2->t1~ would be truthy, thanks to the code added
by Louis Reasoner.

Given that the former is truthy, we would call

#+begin_src scheme
  (apply-generic 'exp (t1->t2 CN1) CN2)
#+end_src

~(t1->t2 CN1)~ evaluates to CN1, so we would call ~apply-generic~
again with its original arguments. So: we would be calling
~apply-generic~ /ad infinitum/ with the same arguments.

*** b
Think about what happens if we call ~exp~ with two rational numbers or
complex numbers without the additional code provided by Louis
Reasoner.

# #+begin_src scheme
#   (exp CN1 CN2)
#   ;     |
#   ;     V
#   (apply-generic 'exp '(complex complex))
#   ;     |
#   ;     V
#   ;     ?
# #+end_src

~Apply-generic~ would not find a ~proc~ (when it uses ~get~), and so
(given that ~(= (length args) 2)~ is true) is going to apply
~get-coercion~ twice. So, yeah, Louis Reasoner was right. Something
has to be done.
