blog/22.html

<div id="outline-container-org92f6040" class="outline-2">
<h2 id="org92f6040">2.5.2 Combining Data of Different Types</h2>
<div class="outline-text-2" id="text-org92f6040">
<p>
So far we have considered operations on objects of the same type. For
example, the addition of two ordinary numbers or the multiplication of
two rational numbers. But this means that the operations we have
defined ``treat the different data types as being completely
independent.''. We haven't dealt with, say the addition of an ordinary
number and a rational number, or the division of a rational number and
a complex number. How should we introduce ``cross-type'' operations in
our system?
</p>

<blockquote>
<p>
one way to handle cross-type operations is to design a different
procedure for each possible combination of types for which the
operation is valid. [&#x2026;] this technique works, but it is cumbersome.
</p>
</blockquote>

<p>
When we can, we should be ``by taking advantage of additional
structure that may be latent in our type system'': often an object of
a certain data type can be seen as an object of a another data
type. E.g., the rational number 2/2, can be seen as the ordinary
number 1. Given so, if we are asked to perform an operation on a
rational number and an ordinary number, we could try to ``coerce'' the
rational number into an ordinary number. And if we are successful in
doing so, then we can use our good old procedure that works with
ordinary numbers.
</p>

<p>
The coercion idea can be implement by designing coercion procedures,
installing them into a coercion table, and then modifying
<code>apply-generic</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scheme-number-&gt;complex</span> n)
  (make-complex-from-real-imag (contents n) 0))

(put-coercion 'scheme-number 'complex scheme-number-&gt;complex)

<span style="color: #595959;">;; </span><span style="color: #595959;">For simplicity, only the case in which there are two arguments is</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">considered</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">apply-generic</span> op . args)
  (<span style="color: #531ab6;">let</span> ((type-tags (<span style="color: #531ab6;">map</span> type-tag args)))
    (<span style="color: #531ab6;">let</span> ((proc (get op type-tags)))
      (<span style="color: #531ab6;">if</span> proc
          (apply proc (<span style="color: #531ab6;">map</span> contents args))
          (<span style="color: #531ab6;">if</span> (= (length args) 2)
              (<span style="color: #531ab6;">let</span> ((type1 (car type-tags))
                    (type2 (cadr type-tags))
                    (a1 (car args))
                    (a2 (cadr args)))
                (<span style="color: #531ab6;">let</span> ((t1-&gt;t2 (get-coercion type1 type2))
                      (t2-&gt;t1 (get-coercion type2 type1)))
                  (<span style="color: #531ab6;">cond</span> (t1-&gt;t2
                         (apply-generic op (t1-&gt;t2 a1) a2))
                        (t2-&gt;t1
                         (apply-generic op a1 (t2-&gt;t1 a2)))
                        (<span style="color: #531ab6;">else</span>
                         (error <span style="color: #3548cf;">"No method for these types"</span>
                                (list op type-tags))))))
              (error <span style="color: #3548cf;">"No method for these types"</span>
                     (list op type-tags)))))))
</pre>
</div>

<p>
This coercion scheme is useful, but not general enough: there may be
cases in which it's not possible neither object can be converted into
the type of the other object, but in which both objects could be
converted to a third type.
</p>
</div>

<div id="outline-container-org20c8655" class="outline-3">
<h3 id="org20c8655">Exercise 2.81</h3>
<div class="outline-text-3" id="text-org20c8655">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Louis Reasoner has noticed that <code>apply-generic</code> may try to coerce the
arguments to each other's type even if they already have the same
type. Therefore, he reasons, we need to put procedures in the coercion
table to ``coerce'' arguments of each type to their own type. For
example, in addition to the <code>scheme-number-&gt;complex</code> coercion shown
above, he would do:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scheme-number-&gt;scheme-number</span> n) n)
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">complex-&gt;complex</span> z) z)
(put-coercion 'scheme-number 'scheme-number
scheme-number-&gt;scheme-number)
(put-coercion 'complex 'complex complex-&gt;complex)
</pre>
</div>

<p>
a. With Louis's coercion procedures installed, what happens if
<code>apply-generic</code> is called with two arguments of type <code>scheme-number</code>
or two arguments of type <code>complex</code> for an operation that is not found
in the table for those types? For example, assume that we've defined a
generic exponentiation operation:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">exp</span> x y) (apply-generic 'exp x y))
</pre>
</div>

<p>
and have put a procedure for exponentiation in the Scheme-number
package but not in any other package:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">following added to Scheme-number package</span>
(put 'exp '(scheme-number scheme-number)
(<span style="color: #531ab6;">lambda</span> (x y) (tag (expt x y)))) <span style="color: #595959;">; </span><span style="color: #595959;">using primitive `expt'</span>
</pre>
</div>

<p>
What happens if we call <code>exp</code> with two complex numbers as arguments?
</p>

<p>
b. Is Louis correct that something had to be done about coercion with
arguments of the same type, or does <code>apply-generic</code> work correctly as
is?
</p>

<p>
c. Modify <code>apply-generic</code> so that it doesn't try coercion if the two
arguments have the same type.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>
</div>

<div id="outline-container-org67d56f4" class="outline-4">
<h4 id="org67d56f4">a</h4>
<div class="outline-text-4" id="text-org67d56f4">
<p>
If we call <code>exp</code> with two complex numbers, we would call
</p>

<div class="org-src-container">
<pre class="src src-scheme">(apply-generic 'exp CN1 CN2)
</pre>
</div>

<p>
We are not going to find a procedure, because we don't have an object
in the table for row <code>'exp</code> and column <code>'(complex complex)</code>.
</p>

<p>
So we would go inside the second <code>if</code>.
</p>

<p>
Both <code>t1-&gt;t2</code> and <code>t2-&gt;t1</code> would be truthy, thanks to the code added
by Louis Reasoner.
</p>

<p>
Given that the former is truthy, we would call
</p>

<div class="org-src-container">
<pre class="src src-scheme">(apply-generic 'exp (t1-&gt;t2 CN1) CN2)
</pre>
</div>

<p>
<code>(t1-&gt;t2 CN1)</code> evaluates to CN1, so we would call <code>apply-generic</code>
again with its original arguments. So: we would be calling
<code>apply-generic</code> <i>ad infinitum</i> with the same arguments.
</p>
</div>
</div>

<div id="outline-container-org6d626c7" class="outline-4">
<h4 id="org6d626c7">b</h4>
<div class="outline-text-4" id="text-org6d626c7">
<p>
Think about what happens if we call <code>exp</code> with two rational numbers or
complex numbers without the additional code provided by Louis
Reasoner.
</p>

<p>
<code>Apply-generic</code> would not find a <code>proc</code> (when it uses <code>get</code>), and so
(given that <code>(= (length args) 2)</code> is true) is going to apply
<code>get-coercion</code> twice. So, yeah, Louis Reasoner was right. Something
has to be done.
</p>
</div>
</div>
