blog/22.org
*** c
My first instinct is to turn

#+begin_src scheme
  (if (= (length args) 2)
#+end_src

into

#+begin_src scheme
  (if (and (= (length args) 2)
           (eq (car (type-tags))
               (cadr (type-tags))))
#+end_src

There might be more elegant ways of doing it, but this should work.
Here is the modified procedure:

#+begin_src scheme
  (define (apply-generic op . args)
    (let ((type-tags (map type-tag args)))
      (let ((proc (get op type-tags)))
        (if proc
            (apply proc (map contents args))
            (if (and (= (length args) 2)
                     (eq (car (type-tags))
                         (cadr (type-tags))))
                (let ((type1 (car type-tags))
                      (type2 (cadr type-tags))
                      (a1 (car args))
                      (a2 (cadr args)))
                  (let ((t1->t2 (get-coercion type1 type2))
                        (t2->t1 (get-coercion type2 type1)))
                    (cond (t1->t2
                           (apply-generic op (t1->t2 a1) a2))
                          (t2->t1
                           (apply-generic op a1 (t2->t1 a2)))
                          (else
                           (error "No method for these types"
                                  (list op type-tags))))))
                (error "No method for these types"
                       (list op type-tags)))))))
#+end_src
** Exercise 2.82
*Exercise*:

#+begin_quote
Show how to generalize ~apply-generic~ to handle coercion in the
general case of multiple arguments. One strategy is to attempt to
coerce all the arguments to the type of the first argument, then to
the type of the second argument, and so on. Give an example of a
situation where this strategy (and likewise the two-argument version
given above) is not sufficiently general. (Hint: Consider the case
where there are some suitable mixed-type operations present in the
table that will not be tried.)
#+end_quote

*Answer*:

Authors are telling us what to try: ``One strategy is to attempt to
coerce all the arguments to the type of the first argument, then to
the type of the second argument, and so on.''

So we need to ``loop'' over the arguments and, for each one of them,
we get its type and then try to coerce all the others to that
type. This sort of ``double loop'' operation probably lends itself to
be handled in some elegant way using higher-order procedures.

In the following approach, if the first retrieval of ~proc~ fails, I'm
going to loop over each argument using what I would call ``procedural
iteration'' (Cf. pp. 32-33). I create the list of the functions needed
from the coercion table, and create, if possible (if I've found all
relevant procedures), the list of all coerced arguments. We then try
to retrieve the relevant ~proc~ again. I we succeed we can call
~apply~, otherwise we keep iterating.

#+begin_src scheme
  (define (apply-generic op . args)
    (let ((type-tags (map type-tag args)))
      (let ((proc (get op type-tags)))
        (if proc
            (apply proc (map contents args))
            (apply-generic-coerce 0 op . args)))))

  (define (apply-generic-coerce i op . args)
    (if (>= i (length args))
        (error "failed to find op")
        ;; find type of args with index i
        (let ((type (type-tag (list-ref args i))))
          ;; build a list of all the functions that are needed from the coercion table
          ;; (when the type is the same we can just use the identity function.
          (let ((coercing-funs (map (lambda (arg)
                                      (if (eq? (type-tag arg) type)
                                          identity
                                          (get-coercion (type-tag arg) type)))
                                    args)))
            (if (> (length (filter is-falsy coercing-funs) 0)
                   ;; try with next type
                   (apply-generic-coerce (+ 1 i) op . args)
                   (let ((coerced-args (map (lambda (arg)
                                              ((get-coercion (type-tag arg) type) arg)))))
                     (let ((proc (get op (map type-tags coerced-args))))
                       (if proc
                           ;; found proc!
                           (apply proc (map contents coerced-args))
                           ;; try with next type
                           (apply-generic-coerce (+ 1 i) op . args))))))))))
#+end_src

I suspect that the situations in which the procedure is not going to
work are those situations in which, in order to find an operation in
our table, we would have to coerce each argument to some type which
differs from any of the types of the arguments.  For example, if we
have in the table an operation ~foo~ which works on triangles and we
try to apply it to an isosceles triangle and a right triangle, trying
to coerce the isosceles triangle to a right triangle or vice versa
will not work. We will have instead to coerce both the isosceles and
the right triangles to a triangle.

#+begin_export html
<div style="text-align: center;">
<a href="./posts.html">←</a>
</div>
#+end_export
