blog/22.html
<div id="outline-container-orgc10e731" class="outline-4">
<h4 id="orgc10e731">c</h4>
<div class="outline-text-4" id="text-orgc10e731">
<p>
My first instinct is to turn
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">if</span> (= (length args) 2)
</pre>
</div>

<p>
into
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">if</span> (<span style="color: #531ab6;">and</span> (= (length args) 2)
         (eq (car (type-tags))
             (cadr (type-tags))))
</pre>
</div>

<p>
There might be more elegant ways of doing it, but this should work.
Here is the modified procedure:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">apply-generic</span> op . args)
  (<span style="color: #531ab6;">let</span> ((type-tags (<span style="color: #531ab6;">map</span> type-tag args)))
    (<span style="color: #531ab6;">let</span> ((proc (get op type-tags)))
      (<span style="color: #531ab6;">if</span> proc
          (apply proc (<span style="color: #531ab6;">map</span> contents args))
          (<span style="color: #531ab6;">if</span> (<span style="color: #531ab6;">and</span> (= (length args) 2)
                   (eq (car (type-tags))
                       (cadr (type-tags))))
              (<span style="color: #531ab6;">let</span> ((type1 (car type-tags))
                    (type2 (cadr type-tags))
                    (a1 (car args))
                    (a2 (cadr args)))
                (<span style="color: #531ab6;">let</span> ((t1-&gt;t2 (get-coercion type1 type2))
                      (t2-&gt;t1 (get-coercion type2 type1)))
                  (<span style="color: #531ab6;">cond</span> (t1-&gt;t2
                         (apply-generic op (t1-&gt;t2 a1) a2))
                        (t2-&gt;t1
                         (apply-generic op a1 (t2-&gt;t1 a2)))
                        (<span style="color: #531ab6;">else</span>
                         (error <span style="color: #3548cf;">"No method for these types"</span>
                                (list op type-tags))))))
              (error <span style="color: #3548cf;">"No method for these types"</span>
                     (list op type-tags)))))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfb17cb5" class="outline-3">
<h3 id="orgfb17cb5">Exercise 2.82</h3>
<div class="outline-text-3" id="text-orgfb17cb5">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Show how to generalize <code>apply-generic</code> to handle coercion in the
general case of multiple arguments. One strategy is to attempt to
coerce all the arguments to the type of the first argument, then to
the type of the second argument, and so on. Give an example of a
situation where this strategy (and likewise the two-argument version
given above) is not sufficiently general. (Hint: Consider the case
where there are some suitable mixed-type operations present in the
table that will not be tried.)
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
Authors are telling us what to try: ``One strategy is to attempt to
coerce all the arguments to the type of the first argument, then to
the type of the second argument, and so on.''
</p>

<p>
So we need to ``loop'' over the arguments and, for each one of them,
we get its type and then try to coerce all the others to that
type. This sort of ``double loop'' operation probably lends itself to
be handled in some elegant way using higher-order procedures.
</p>

<p>
In the following approach, if the first retrieval of <code>proc</code> fails, I'm
going to loop over each argument using what I would call ``procedural
iteration'' (Cf. pp. 32-33). I create the list of the functions needed
from the coercion table, and create, if possible (if I've found all
relevant procedures), the list of all coerced arguments. We then try
to retrieve the relevant <code>proc</code> again. I we succeed we can call
<code>apply</code>, otherwise we keep iterating.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">apply-generic</span> op . args)
  (<span style="color: #531ab6;">let</span> ((type-tags (<span style="color: #531ab6;">map</span> type-tag args)))
    (<span style="color: #531ab6;">let</span> ((proc (get op type-tags)))
      (<span style="color: #531ab6;">if</span> proc
          (apply proc (<span style="color: #531ab6;">map</span> contents args))
          (apply-generic-coerce 0 op . args)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">apply-generic-coerce</span> i op . args)
  (<span style="color: #531ab6;">if</span> (&gt;= i (length args))
      (error <span style="color: #3548cf;">"failed to find op"</span>)
      <span style="color: #595959;">;; </span><span style="color: #595959;">find type of args with index i</span>
      (<span style="color: #531ab6;">let</span> ((type (type-tag (list-ref args i))))
        <span style="color: #595959;">;; </span><span style="color: #595959;">build a list of all the functions that are needed from the coercion table</span>
        <span style="color: #595959;">;; </span><span style="color: #595959;">(when the type is the same we can just use the identity function.</span>
        (<span style="color: #531ab6;">let</span> ((coercing-funs (<span style="color: #531ab6;">map</span> (<span style="color: #531ab6;">lambda</span> (arg)
                                    (<span style="color: #531ab6;">if</span> (eq? (type-tag arg) type)
                                        identity
                                        (get-coercion (type-tag arg) type)))
                                  args)))
          (<span style="color: #531ab6;">if</span> (&gt; (length (filter is-falsy coercing-funs) 0)
                 <span style="color: #595959;">;; </span><span style="color: #595959;">try with next type</span>
                 (apply-generic-coerce (+ 1 i) op . args)
                 (<span style="color: #531ab6;">let</span> ((coerced-args (<span style="color: #531ab6;">map</span> (<span style="color: #531ab6;">lambda</span> (arg)
                                            ((get-coercion (type-tag arg) type) arg)))))
                   (<span style="color: #531ab6;">let</span> ((proc (get op (<span style="color: #531ab6;">map</span> type-tags coerced-args))))
                     (<span style="color: #531ab6;">if</span> proc
                         <span style="color: #595959;">;; </span><span style="color: #595959;">found proc!</span>
                         (apply proc (<span style="color: #531ab6;">map</span> contents coerced-args))
                         <span style="color: #595959;">;; </span><span style="color: #595959;">try with next type</span>
                         (apply-generic-coerce (+ 1 i) op . args))))))))))
</pre>
</div>

<p>
I suspect that the situations in which the procedure is not going to
work are those situations in which, in order to find an operation in
our table, we would have to coerce each argument to some type which
differs from any of the types of the arguments.  For example, if we
have in the table an operation <code>foo</code> which works on triangles and we
try to apply it to an isosceles triangle and a right triangle, trying
to coerce the isosceles triangle to a right triangle or vice versa
will not work. We will have instead to coerce both the isosceles and
the right triangles to a triangle.
</p>

<div style="text-align: center;">
<a href="./posts.html">←</a>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</span></p>
</div>
</body>
</html>
